# 2. Pandas in Python

In [1]:
import pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.1'

# Why we use Pandas?
 * __Pandas allows us to analyze big data and make conclusion based on satistical theories.__
 * __Pandas can clean messy data sets, and make them readable and relevant.__
 * __Relevant data is very important in data sciecne.__

# Data Science
 * __Data Science is a branch of computer science where we study how to store, use and analyze data for deriving information from it.__

# We can Pandas Do?
 * __Pandas gives you answers about the data. Like:__
    * __Is there a correlation between two or more columns?__
    * __What is the average value?__
    * __Max value?__
    * __Min Value?__
  
    * __Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values, This is called cleaning the data.__

# Data Structures in Pandas Library
 * __Pandas generally provide two data structure for manipulating data. They are:__
    * __1. Series__
    * __2. DataFrame__
  
# Pandas Series
 * __A pandas Series is a one-dimensional labeled array capable of holding data of any type(integer, string, float, python objects etc). The Axis labels are collectively called indexes.__

# Data Frame
 * __Pandas DataFrme is a two-dimensional data structure with labeled axes(rows and columns).__

In [14]:
import pandas as pd
import numpy as np

In [15]:
ser=pd.Series()
ser

Series([], dtype: object)

In [16]:
type(ser)

pandas.core.series.Series

In [17]:
data = np.array(['apple','elephant','kite','sun','moon','earth','jupiter','saturn','mars','venus'])
data

array(['apple', 'elephant', 'kite', 'sun', 'moon', 'earth', 'jupiter',
       'saturn', 'mars', 'venus'], dtype='<U8')

In [18]:
data.dtype

dtype('<U8')

In [19]:
data.size

10

In [20]:
ser=pd.Series(data)
print('Pandas Series:\n',ser)

Pandas Series:
 0       apple
1    elephant
2        kite
3         sun
4        moon
5       earth
6     jupiter
7      saturn
8        mars
9       venus
dtype: object

In [21]:
# Accessing these element using index value
print(ser[0])
print(ser[1])
print(ser[2])
print(ser[3])
print(ser[4])
print(ser[5])
print(ser[6])
print(ser[7])
print(ser[8])
print(ser[9])

apple
elephant
kite
sun
moon
earth
jupiter
saturn
mars
venus

In [22]:
ser.ndim

1

In [23]:
ser.size

10

# DataFrame

In [24]:
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [25]:
lst=['Python',"Java","JavaScript","Kotlin","C++","C#","Django","FastAPI","Bootstrap"]
lst

['Python',
 'Java',
 'JavaScript',
 'Kotlin',
 'C++',
 'C#',
 'Django',
 'FastAPI',
 'Bootstrap']

In [26]:
df=pd.DataFrame(lst)
df

            0
0      Python
1        Java
2  JavaScript
3      Kotlin
4         C++
5          C#
6      Django
7     FastAPI
8   Bootstrap

In [27]:
df.ndim

2

In [28]:
ser.ndim

1

In [29]:
# Creating a series

list_s=[1,2,-3,6.2,'data values']
print(list_s)

[1, 2, -3, 6.2, 'data values']

In [30]:
print(type(list_s))

<class 'list'>

In [31]:
series=pd.Series(list_s)
series

0              1
1              2
2             -3
3            6.2
4    data values
dtype: object

In [32]:
series.ndim

1

In [33]:
series.size

5

In [34]:
series.shape

(5,)

In [35]:
type(series)

pandas.core.series.Series

In [36]:
# creating new series using Series()

series2=pd.Series([1,2,3,4])
series2

0    1
1    2
2    3
3    4
dtype: int64

In [37]:
# Creating empty series

empty_s=pd.Series([])
empty_s

Series([], dtype: object)

In [38]:
series2

0    1
1    2
2    3
3    4
dtype: int64

In [39]:
# Changing row-index in series


series2=pd.Series([1,2,3,4],index=['a','b','c','d'])
series2

a    1
b    2
c    3
d    4
dtype: int64

In [40]:
# Changing datatype in pandas series
series2=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype=float)
series2

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [41]:
# how to set series name 
series3=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype=float,name="dataValues")
series3

a    1.0
b    2.0
c    3.0
d    4.0
Name: dataValues, dtype: float64

In [42]:
# how to create series in single values(Scalar) => Scaler has one dimensional array.
scalar_s=pd.Series(0.5)
scalar_s

0    0.5
dtype: float64

In [43]:
scalar_s=pd.Series(0.5,index=[1,2,3])
scalar_s

1    0.5
2    0.5
3    0.5
dtype: float64

In [44]:
# how to create series with the help of python dictionary.

dict_s=pd.Series({'a':10,'b':20,'c':30},dtype=float)
dict_s

a    10.0
b    20.0
c    30.0
dtype: float64

In [45]:
dict_s['a']

10.0

In [46]:
# slicing series data
s4=pd.Series([1,2,3,4,5,6])
s4

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [47]:
# Slicing element inside the Seris
s4[0:3]

0    1
1    2
2    3
dtype: int64

In [48]:
# print odd series
s4[::2]

0    1
2    3
4    5
dtype: int64

In [49]:
# printing even series

s4[::3]

0    1
3    4
dtype: int64

In [50]:
# how to find maximum values in series

s4

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [51]:
max(s4)

6

In [52]:
# changing element inside the Series

s4[3]=25
s4

0     1
1     2
2     3
3    25
4     5
5     6
dtype: int64

In [53]:
max(s4)

25

In [54]:
# finding minimum values inside the Series

min(s4)

1

In [55]:
# how to use condition operators in series
print(s4)
s4[1]<0

0     1
1     2
2     3
3    25
4     5
5     6
dtype: int64

False

In [56]:
s5=pd.Series([10,20,30,40,50,60,70])
s5

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [57]:
print(s4)
print(s5)

0     1
1     2
2     3
3    25
4     5
5     6
dtype: int64
0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [58]:
s4[3]=4
print(s4)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [59]:
# Adding two Series in one.
print(s4)
print(s5)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [60]:
# Adding two Series 

newSeries=s4+s5
print(newSeries)

0    11.0
1    22.0
2    33.0
3    44.0
4    55.0
5    66.0
6     NaN
dtype: float64

In [61]:
s6=pd.Series([1,2,3])
s6

0    1
1    2
2    3
dtype: int64

In [62]:
print(s4)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [63]:
new_Series=s6+s4
print(new_Series)

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
5    NaN
dtype: float64

In [64]:
# multiplication
print(s4)
print(s6)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0    1
1    2
2    3
dtype: int64

In [65]:
multi_Series=s6*s4
print(multi_Series)

0    1.0
1    4.0
2    9.0
3    NaN
4    NaN
5    NaN
dtype: float64

In [66]:
# finding Exponent between two seris
print(s4)
print(s6)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0    1
1    2
2    3
dtype: int64

In [67]:
expo_Series=s4**s6
print(expo_Series)

0     1.0
1     4.0
2    27.0
3     NaN
4     NaN
5     NaN
dtype: float64

In [68]:
# Finding Modulus between two series
print(s4)
print(s6)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0    1
1    2
2    3
dtype: int64

In [69]:
modulus_Series=s4%s6
modulus_Series

0    0.0
1    0.0
2    0.0
3    NaN
4    NaN
5    NaN
dtype: float64

# DataFrame()

In [70]:
import pandas as pd

In [71]:
emp_df=pd.DataFrame()
print(emp_df)

Empty DataFrame
Columns: []
Index: []

In [72]:
list_of_list=[[1,2,3],[4,5,6],[2,3,4]]
list_of_list

[[1, 2, 3], [4, 5, 6], [2, 3, 4]]

In [73]:
df2=pd.DataFrame(list_of_list)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  2  3  4

In [74]:
df2[1][0]=100
df2

C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\4020326481.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2[1][0]=100

   0    1  2
0  1  100  3
1  4    5  6
2  2    3  4

In [75]:
df2[2][1]=16
df2

C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\773796416.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2[2][1]=16

   0    1   2
0  1  100   3
1  4    5  16
2  2    3   4

In [76]:
# Creating pandas DataFrame from pyton dictionary(dictionary of list)
# creting dictionary
dict_Python={'ID':[11,22,33,44],"Name":["Ram","Shyam","Laxman","Bharat"]}
dict_Python

{'ID': [11, 22, 33, 44], 'Name': ['Ram', 'Shyam', 'Laxman', 'Bharat']}

In [77]:
df3=pd.DataFrame(dict_Python)
df3

   ID    Name
0  11     Ram
1  22   Shyam
2  33  Laxman
3  44  Bharat

In [78]:
df3['Name'][0]="Deepali"
df3

C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\1073898131.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3['Name'][0]="Deepali"
C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\1073898131.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Name'][0]="Deepali"

   ID     Name
0  11  Deepali
1  22    Shyam
2  33   Laxman
3  44   Bharat

In [79]:
df3['Name'][1]="Anushtha"
df3

C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\2910496361.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3['Name'][1]="Anushtha"
C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\2910496361.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Name'][1]="Anushtha"

   ID      Name
0  11   Deepali
1  22  Anushtha
2  33    Laxman
3  44    Bharat

In [80]:
df3["Name"][2]="Priya"
df3

C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\1192937961.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3["Name"][2]="Priya"
C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\1192937961.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3["Name"][2]="Priya"

   ID      Name
0  11   Deepali
1  22  Anushtha
2  33     Priya
3  44    Bharat

In [81]:
df3["Name"][3]="Saloni"
df3

C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\2096408852.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3["Name"][3]="Saloni"
C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\2096408852.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3["Name"][3]="Saloni"

   ID      Name
0  11   Deepali
1  22  Anushtha
2  33     Priya
3  44    Saloni

In [82]:
df3['ID'][0]=101
df3

C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\1731132880.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3['ID'][0]=101
C:\Users\Admin\AppData\Local\Temp\ipykernel_1476\1731132880.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['ID'][0]=101

    ID      Name
0  101   Deepali
1   22  Anushtha
2   33     Priya
3   44    Saloni

In [83]:
# Creating two dictionary values with unequal element

ls_dict=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4, 'c': 5}]

In [84]:
df5=pd.DataFrame(ls_dict)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [85]:
df5['a'][0].dtype

dtype('int64')

In [86]:
# Creating dataFrame form dictionary of series
# pd.Series() <-----------------To Create Series
dict_sr={"ID":pd.Series([1,2,3]),"SN":pd.Series([111,222,333])}
dict_sr

{'ID': 0    1
 1    2
 2    3
 dtype: int64,
 'SN': 0    111
 1    222
 2    333
 dtype: int64}

In [87]:
df6=pd.DataFrame(dict_sr)
df6

   ID   SN
0   1  111
1   2  222
2   3  333

# Pandas Read CSV
 * __A simple way to store big data sets is to use CSV file(Comma separated files).__
 * __CSV files contains plain text and is a well know format that can be read by everyone including pandas.__

In [88]:
import pandas as pd

df=pd.read_csv("C:\\Users\\Admin\\Downloads\\student_results.csv")
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percentage
0,1001,10,2,9.0,3,5.0,50
1,1002,10,6,8.0,2,NaN,80
2,1003,10,3,NaN,2,NaN,60
3,1004,11,0,NaN,1,NaN,45
4,1005,11,4,NaN,2,NaN,75
5,1006,11,10,NaN,0,NaN,96
6,1007,12,4,6.0,0,NaN,80
7,1008,12,10,6.0,2,0.0,90
8,1009,12,2,8.0,2,4.0,60
9,1010,12,6,9.0,1,0.0,85

In [89]:
import pandas as pd

In [115]:
df=pd.read_csv("D:\\data.csv")
df

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
...,...,...,...,...,...,...,...,...,...,...
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [95]:
import os

In [96]:
# how to check your current location of your pandas file.
print(os.getcwd())

D:\Python_02-04-(April-8)\Data_Analysis

In [97]:
# check the file type of pandas file
type(df)

pandas.core.frame.DataFrame

In [98]:
# how to check total column in the file.
df.columns

Index(['1st', '2nd', '3rd', '4th', '5th', 'College Code', 'Gender', 'Roll',
       'Roll no.', 'Subject Code'],
      dtype='object')

In [124]:
# how to read specific columns
df1=pd.read_csv("D:\\data.csv",usecols=["College Code","Gender","Roll","Roll no."])
df1

     College Code  Gender     Roll  Roll no.
0             115  Female      NaN   17020.0
1             115    Male      NaN   17021.0
2             115  Female      NaN   17022.0
3             115    Male      NaN   17023.0
4             115    Male      NaN   17024.0
..            ...     ...      ...       ...
173           241       F  17048.0       NaN
174           241       M  17049.0       NaN
175           241       M  17050.0       NaN
176           241       M  17051.0       NaN
177           241       M  17052.0       NaN

[178 rows x 4 columns]

In [125]:
df

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
...,...,...,...,...,...,...,...,...,...,...
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [126]:
# how to skip columns from datasets
df2=pd.read_csv("D:\\data.csv",skiprows=[0,1,2,3,4])
df2

     7.89  7.34  7.22  7.32  7.46  115    Male  Unnamed: 7  17024.0  16
0    7.33  6.72  6.48  6.50  7.39  115    Male         NaN  17025.0  16
1    7.15  6.72  6.89  6.86  7.64  115    Male         NaN  17026.0  16
2    6.74  6.38  4.93  5.64  6.75  115    Male         NaN  17027.0  16
3    7.89  7.45  6.96  7.71  8.00  115  Female         NaN  17028.0  16
4    7.30  6.34  6.30  6.61  6.18  115    Male         NaN  17029.0  16
..    ...   ...   ...   ...   ...  ...     ...         ...      ...  ..
168  7.48  7.55  7.67  7.39  8.65  241       F     17048.0      NaN  28
169  7.30  6.41  6.59  7.11  7.38  241       M     17049.0      NaN  28
170  6.30  6.28  5.89  5.71  6.50  241       M     17050.0      NaN  28
171  7.04  7.10  6.81  7.00  6.92  241       M     17051.0      NaN  28
172  6.70  6.81  6.52  5.39  7.00  241       M     17052.0      NaN  28

[173 rows x 10 columns]

In [127]:
df

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
...,...,...,...,...,...,...,...,...,...,...
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [129]:
df.head(10)

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
5,7.33,6.72,6.48,6.50,7.39,115,Male,NaN,17025.0,16
6,7.15,6.72,6.89,6.86,7.64,115,Male,NaN,17026.0,16
7,6.74,6.38,4.93,5.64,6.75,115,Male,NaN,17027.0,16
8,7.89,7.45,6.96,7.71,8.00,115,Female,NaN,17028.0,16
9,7.30,6.34,6.30,6.61,6.18,115,Male,NaN,17029.0,16

In [130]:
# how to skip columns from datasets
df

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
...,...,...,...,...,...,...,...,...,...,...
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [146]:
# how to skip columns from datasets
# how to skip columns from datasets
# how to skip columns from datasets
# df2=pd.read_csv("D:\\data.csv",skiprows=[0])
# df2

# how to skip columns from datasets
# df
# how to skip columns from datasets
df2=pd.read_csv("D:\\data.csv",skiprows=[3,4])
df2

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
3,7.33,6.72,6.48,6.50,7.39,115,Male,NaN,17025.0,16
4,7.15,6.72,6.89,6.86,7.64,115,Male,NaN,17026.0,16
...,...,...,...,...,...,...,...,...,...,...
171,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
172,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
173,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
174,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
175,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [149]:
df3=pd.read_csv("D:\\data.csv",usecols=[0,9])
df3

      1st  Subject Code
0    8.11            16
1    6.48            16
2    8.41            16
3    7.33            16
4    7.89            16
..    ...           ...
173  7.48            28
174  7.30            28
175  6.30            28
176  7.04            28
177  6.70            28

[178 rows x 2 columns]

In [159]:
# how to remove header from csv file.

df2=pd.read_csv("D:\\data.csv",header=None)
df2

,0,1,2,3,4,5,6,7,8,9
0,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
1,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
2,6.48,5.9,4.15,4.29,4.96,115,Male,NaN,17021.0,16
3,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
4,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
...,...,...,...,...,...,...,...,...,...,...
174,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
175,7.3,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
176,6.3,6.28,5.89,5.71,6.5,241,M,17050.0,NaN,28
177,7.04,7.1,6.81,7.0,6.92,241,M,17051.0,NaN,28
178,6.7,6.81,6.52,5.39,7.0,241,M,17052.0,NaN,28

In [167]:
df2=pd.read_csv("D:\\data.csv",names=["Ram","Shayam","3rd","4th","5th","College Code","Gender","Roll","Roll no."])
df2

,Ram,Shayam,3rd,4th,5th,College Code,Gender,Roll,Roll no.
1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
6.48,5.9,4.15,4.29,4.96,115,Male,NaN,17021.0,16
8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
...,...,...,...,...,...,...,...,...,...
7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
7.3,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
6.3,6.28,5.89,5.71,6.5,241,M,17050.0,NaN,28
7.04,7.1,6.81,7.0,6.92,241,M,17051.0,NaN,28
6.7,6.81,6.52,5.39,7.0,241,M,17052.0,NaN,28

In [168]:
df2=pd.read_csv("D:\\data.csv")
df2

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
...,...,...,...,...,...,...,...,...,...,...
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

# json 
 * __JavaScript Object Notation__
 * __Big data sets are ofted stored, or extracted as JSON:__
 * __JSON is a plain text, but the format of an object, and is well known in the world of programming, including pandas.__

In [174]:
import pandas as pd

In [176]:
import json

# Load the JSON file
with open('dwsample1-json.json') as f:
    data = json.load(f)

# Inspect the data
print(data)

{'fruit': 'Apple', 'size': 'Large', 'color': 'Red'}

In [181]:
data

{'fruit': 'Apple', 'size': 'Large', 'color': 'Red'}

In [184]:
data['fruit']="Abhishek"

In [185]:
data

{'fruit': 'Abhishek', 'size': 'Large', 'color': 'Red'}

In [186]:
df

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
...,...,...,...,...,...,...,...,...,...,...
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [197]:
df.head(51)

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
5,7.33,6.72,6.48,6.50,7.39,115,Male,NaN,17025.0,16
6,7.15,6.72,6.89,6.86,7.64,115,Male,NaN,17026.0,16
7,6.74,6.38,4.93,5.64,6.75,115,Male,NaN,17027.0,16
8,7.89,7.45,6.96,7.71,8.00,115,Female,NaN,17028.0,16
9,7.30,6.34,6.30,6.61,6.18,115,Male,NaN,17029.0,16
10,8.00,7.90,7.52,7.64,8.11,115,Male,NaN,17030.0,16
11,6.78,4.28,5.81,6.04,6.39,115,Male,NaN,17031.0,16
12,5.67,5.62,5.48,5.93,6.75,115,Male,NaN,17032.0,16
13,6.33,6.41,6.41,6.93,7.00,115,Male,NaN,17033.0,16
14,6.44,6.21,6.19,6.68,6.86,115,Male,NaN,17034.0,16
15,6.30,6.17,5.59,5.89,6.36,115,Male,NaN,17035.0,16
16,6.96,6.14,6.93,7.18,7.29,115,Male,NaN,17036.0,16
17,6.70,6.45,5.78,6.00,6.61,115,Male,NaN,17037.0,16
18,7.41,6.93,7.33,7.71,8.46,115,Male,NaN,17038.0,16
19,7.04,6.31,6.44,7.21,7.32,115,Male,NaN,17039.0,16
20,6.63,5.62,6.11,5.79,6.25,115,Male,NaN,17040.0,16
21,8.33,8.72,7.81,8.04,8.93,115,Female,NaN,17041.0,16
22,7.96,7.93,7.78,8.21,8.21,115,Male,NaN,17042.0,16
23,6.89,5.55,5.93,6.79,7.54,115,Male,NaN,17043.0,16
24,8.19,8.17,7.15,7.75,7.64,115,Male,NaN,17044.0,16
25,7.89,6.69,7.15,8.43,8.36,115,Female,NaN,17045.0,16
26,7.33,6.55,5.96,6.75,6.89,115,Male,NaN,17046.0,16
27,8.22,8.17,8.37,9.04,9.00,115,Male,NaN,17047.0,16
28,7.44,7.59,7.26,7.89,7.86,115,Male,NaN,17048.0,16
29,5.74,6.45,6.48,7.29,7.61,115,Male,NaN,17049.0,16
30,6.81,6.79,6.30,7.14,7.86,115,Female,NaN,17050.0,16
31,8.89,8.31,7.30,9.25,8.50,115,Female,NaN,17051.0,16
32,8.04,7.59,7.22,8.32,8.82,115,Male,NaN,17052.0,16
33,8.30,8.38,7.63,7.93,8.75,115,Male,NaN,17053.0,16
34,8.04,6.69,6.37,6.64,6.64,115,Male,NaN,17054.0,16
35,7.44,7.97,7.78,8.64,8.71,115,Male,NaN,17055.0,16
36,7.85,6.90,7.04,7.82,8.39,115,Female,NaN,17056.0,16
37,8.07,7.34,7.59,7.89,8.14,115,Male,NaN,17057.0,16
38,7.59,7.38,7.30,8.64,8.21,115,Male,NaN,17058.0,16
39,8.19,7.66,7.48,8.68,8.89,115,Male,NaN,17059.0,16
40,5.81,5.83,4.15,4.93,4.86,115,Male,NaN,17060.0,16
41,6.30,6.24,5.85,6.36,7.00,115,Male,NaN,17061.0,16
42,7.78,6.93,7.44,7.86,8.21,115,Male,NaN,17062.0,16
43,8.22,6.66,7.07,7.29,7.61,115,Male,NaN,17063.0,16
44,7.67,7.07,7.04,7.07,6.93,115,Male,NaN,17064.0,16
45,8.41,7.59,7.41,7.89,8.11,115,Male,NaN,17065.0,16
46,7.59,7.83,6.89,7.32,8.50,165,M,17021.0,NaN,16
47,5.30,5.62,4.56,4.36,6.18,165,F,17022.0,NaN,16
48,7.26,7.62,7.26,7.29,7.61,165,M,17023.0,NaN,16
49,7.93,7.83,7.81,8.32,8.68,165,M,17024.0,NaN,16
50,8.11,8.55,7.30,8.11,9.14,165,M,17025.0,NaN,16

In [189]:
df.tail(10)

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
168,6.81,6.38,5.19,5.46,NaN,241,M,17043.0,NaN,28
169,6.63,7.03,7.00,6.75,7.38,241,M,17044.0,NaN,28
170,7.33,7.34,7.22,7.25,7.08,241,M,17045.0,NaN,28
171,7.15,7.79,7.41,NaN,7.50,241,M,17046.0,NaN,28
172,7.00,7.41,7.15,7.04,7.81,241,M,17047.0,NaN,28
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [190]:
df.tail()

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28

In [191]:
df.head()

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16

In [192]:
# print the file information
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   1st           176 non-null    float64
 1   2nd           174 non-null    float64
 2   3rd           176 non-null    float64
 3   4th           173 non-null    float64
 4   5th           172 non-null    float64
 5   College Code  178 non-null    int64
 6   Gender        177 non-null    object
 7   Roll          132 non-null    float64
 8   Roll no.      46 non-null     float64
 9   Subject Code  178 non-null    int64
dtypes: float64(7), int64(2), object(1)
memory usage: 14.0+ KB
None

# Data Cleaning
 * __Data cleaning means fixing bad data in your dataset.__
 * __Empty cells__
 * __Data in wrong format__
 * __wrong data__
 * __duplicate__

# Remove rows
 * __On way to deal with empty cell is to remove rows that contains empty cells.__

In [194]:
import pandas as pd

df=pd.read_csv("D:\\data.csv")
new_df=df.dropna()
print(new_df.to_string())

Empty DataFrame
Columns: [1st, 2nd, 3rd, 4th, 5th, College Code, Gender, Roll, Roll no., Subject Code]
Index: []

In [195]:
df

,1st,2nd,3rd,4th,5th,College Code,Gender,Roll,Roll no.,Subject Code
0,8.11,7.68,7.11,7.43,8.18,115,Female,NaN,17020.0,16
1,6.48,5.90,4.15,4.29,4.96,115,Male,NaN,17021.0,16
2,8.41,8.24,7.52,8.25,7.75,115,Female,NaN,17022.0,16
3,7.33,6.83,6.33,6.79,6.89,115,Male,NaN,17023.0,16
4,7.89,7.34,7.22,7.32,7.46,115,Male,NaN,17024.0,16
...,...,...,...,...,...,...,...,...,...,...
173,7.48,7.55,7.67,7.39,8.65,241,F,17048.0,NaN,28
174,7.30,6.41,6.59,7.11,7.38,241,M,17049.0,NaN,28
175,6.30,6.28,5.89,5.71,6.50,241,M,17050.0,NaN,28
176,7.04,7.10,6.81,7.00,6.92,241,M,17051.0,NaN,28
177,6.70,6.81,6.52,5.39,7.00,241,M,17052.0,NaN,28